emacs.org
#+property: hea-args :mkdirp yes
#+title: Emacs Configuration

* Introduction

Welcome to my Emacs configuration file! At its base, this file is largely inspired on the configuration of David Wison at [[https://codeberg.org/daviwil/dotfiles]], however, as the configuration grew up, other references and even AI has been used.

* Base Configuration

We start by customizing various built-in variables to fine-tune Emacs's behavior:

- *Visual Feedback*: Disable the audible bell (=visible-bell=) to prevent beeping and instead flash the screen on errors.
- *Startup Behavior*: Suppress the startup message (=inhibit-startup-message=) for a cleaner launch.
- *File Handling*:
  - Disable automatic backup files (=make-backup-files=) and auto-saving to backup files (=auto-save-default=) to reduce clutter.
  - Set tabs to spaces (=indent-tabs-mode=) and define a default tab width (=tab-width=) for consistent indentation.
  - Prefer UTF-8 encoding (=prefer-coding-system=) for better compatibility.
- *Performance*:
  - Adjust garbage collection thresholds (=gc-cons-threshold=) to improve performance during startup and normal operation.
  - Accept redefinition of functions and macros without warning (=ad-redefinition-action=) to avoid unnecessary prompts.
- *File Monitoring*: Enable global auto-revert of buffers (=global-auto-revert-mode=) when files change on disk.
- *Interface Tweaks*:
  - Set the frame title format (=frame-title-format=) to display the full path of the current file or buffer name.
  - Set the initial scratch message (=initial-scratch-message=) to provide a friendly welcome.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
;; -*- lexical-binding: t; -*-

          ;;; This file is generated from the =emacs.org= file in my dotfiles repository!
          ;;; ----- Basic Configuration -----

(setq read-process-output-max (* 1024 1024))  ;; 1MB
(setq process-adaptive-read-buffering nil)

;; Increase the garbage collection threshold during startup for faster startup
(setq gc-cons-threshold most-positive-fixnum)

;; Reset garbage collection thresholds after startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 16 1024 1024))  ;; 16MB
            (setq gc-cons-percentage 0.1)))

(set-language-environment "UTF-8")
(setq locale-coding-system 'utf-8)

(setq network-enable-ipv6 nil)
(setq starttls-use-gnutls t
      starttls-gnutls-program "gnutls-cli")

;; Core settings
(setq visible-bell t                         ;; Flash the screen instead of beeping
      inhibit-startup-message t              ;; Suppress the startup message
      inhibit-startup-screen t               ;; Disable the startup screen
      initial-scratch-message ";; Welcome to Emacs!\n\n"  ;; Set the scratch message
      make-backup-files nil                  ;; Disable backup files
      auto-save-default nil                  ;; Disable auto-saving to backup files
      ad-redefinition-action 'accept         ;; Silence function redefinition warnings
      ring-bell-function 'ignore             ;; Disable the bell completely
      vc-follow-symlinks t                   ;; Always follow symlinks
      large-file-warning-threshold nil       ;; Disable large file warnings
      custom-file (expand-file-name "custom.el" user-emacs-directory) ;; Set custom file
      frame-title-format
      '((:eval (if (buffer-file-name)
                   (abbreviate-file-name (buffer-file-name))
                 "%b")))                     ;; Show full path in frame title
      )

;; Load the custom file if it exists
(when (file-exists-p custom-file)
  (load custom-file t))

;; Set default encoding to UTF-8
(prefer-coding-system 'utf-8)

;; Set tabs to spaces and define tab width
(setq-default indent-tabs-mode nil           ;; Use spaces instead of tabs
              tab-width 2)                   ;; Set default tab width to 2

;; Simplify the interface
(menu-bar-mode -1)                           ;; Disable the menu bar
(tool-bar-mode -1)                           ;; Disable the tool bar
(scroll-bar-mode -1)                         ;; Disable the scroll bar

;; (fset 'geiser-xref-backend (lambda (&rest _) nil))

;; (with-eval-after-load 'xref
;;   (remove-hook 'xref-backend-functions #'geiser-xref-backend))

;; (with-eval-after-load 'geiser
;;   (add-hook 'geiser-mode-hook
;;             (lambda ()
;;               (setq-local xref-backend-functions
;;                           (remq 'geiser-xref-backend xref-backend-functions)))))

;; (with-eval-after-load 'geiser
;;   (add-hook 'geiser-mode-hook
;;             (lambda ()
;;               (add-hook 'xref-backend-functions #'geiser-xref-backend nil t))))


(setenv "PATH" (concat (getenv "HOME") "/.local/bin:" (getenv "PATH")))
(add-to-list 'exec-path (expand-file-name "~/.local/bin"))

#+end_src


* Core Modes

We enable and disable several modes to enhance the user interface:

- *Simplify the Interface*:
  - Disable the menu bar (=menu-bar-mode=), tool bar (=tool-bar-mode=), and scroll bar (=scroll-bar-mode=) to maximize screen real estate.
  - Disable the startup screen (=inhibit-startup-screen=) for a quick start.
- *Enhance Navigation and Editing*:
  - Enable =repeat-mode= for convenient key sequence repetition.
  - Enable =savehist-mode= to preserve minibuffer history across sessions.
  - Enable =save-place-mode= to remember cursor positions in files.
  - Enable =recentf-mode= to keep track of recently opened files.
  - Enable =which-key-mode= for helpful keybinding hints (if installed).
- *Display Settings*:
  - Enable =column-number-mode= to display the cursor's column number.
  - Enable =display-time-mode= to show the current time in the mode line.
  - Enable =display-line-numbers-mode= in programming modes for better code navigation.
  - Enable =global-visual-line-mode= for word-wrapping long lines.
  - Enable =xterm-mouse-mode= to allow mouse interactions in terminal Emacs.
- *Autosave and Backups*:
  - Enable =auto-save-visited-mode= to periodically save files directly.
- *History and Reversion*:
  - Enable =tab-bar-history-mode= to navigate through previous tab window configurations.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Core modes
  (repeat-mode 1)                              ;; Enable repeat mode
  (savehist-mode 1)                            ;; Save minibuffer history
  (save-place-mode 1)                          ;; Remember cursor positions in files
  (recentf-mode 1)                             ;; Enable recent files mode
  (which-key-mode 1)                           ;; Enable which-key mode (if installed)
  (column-number-mode 1)                       ;; Show column numbers
  (display-time-mode 1)                        ;; Display time in mode line
  (global-visual-line-mode 1)                  ;; Wrap long lines visually
  (xterm-mouse-mode 1)                         ;; Enable mouse support in terminal
  (auto-save-visited-mode 1)                   ;; Auto-save files at intervals
  (tab-bar-history-mode 1)                     ;; Enable tab bar history
  (global-auto-revert-mode 1)                  ;; Refresh buffers when files change

  ;; Display line numbers in programming modes
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)

  ;; Set default directory to home
  (setq default-directory "~/")

  ;; Fix locale settings (if needed)
  (when (and (not (getenv "LC_ALL"))
             (or (not (getenv "LANG"))
                 (string= (getenv "LANG") "")))
    (setenv "LANG" "en_US.UTF-8"))
#+end_src

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; -*- lexical-binding: t; -*-

  ;;; This file is generated from the =emacs.org= file in my dotfiles repository!

  ;;; ----- Basic Configuration -----

  ;; Core settings
  (setq visible-bell t                        ;; Flash the UI instead of beeping
        inhibit-startup-message t             ;; Yes, this is emacs
        auto-save-default nil                 ;; Save to the current file, not a backup file
        make-backup-files nil                 ;; No backup files, please
        large-file-warning-threshold nil      ;; Don't warn on large files
        ad-redefinition-action 'accept        ;; Don't warn on advice
        global-auto-revert-non-file-buffers t ;; Revert Dired and other buffers
        )
#+end_src

* Additional Settings

- *Whitespace Management*: Automatically delete trailing whitespace before saving files.
- *Customization File*: Move =custom-file= to a separate file to keep the main configuration clean.
- *Encoding and Locale*:
  - Ensure Emacs correctly handles UTF-8 encoding.
  - Set up the environment's locale to prevent issues with subprocesses.

  #+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
    ;; Tabs to spaces
    (setq-default indent-tabs-mode nil
                  tab-width 2)

    ;; Display line numbers in programming modes
    (add-hook 'prog-mode-hook #'display-line-numbers-mode)

    ;; Delete trailing whitespace before saving buffers
    (add-hook 'before-save-hook 'delete-trailing-whitespace)

    ;; Move customization settings out of init.el
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (when (file-exists-p custom-file)
      (load custom-file t))
  #+end_src

* Appearance

To achieve a consistent and minimalist Emacs appearance that combines the simplicity and colors of /Nano/ with the font styles of *Doom Emacs*, we'll refine the appearance settings in this section. Our goals are:

- *Use the =nano-theme=* for Nano-like simplicity in colors.
- *Configure fonts* to match Doom Emacs's preferences, such as using =JetBrains Mono= for code.
- *Organize and simplify* the configuration for better maintainability.
- *Ensure consistency* by removing redundant or conflicting settings.
- *Enhance portability* by using =use-package= with =:ensure nil=, as my packages are expected to be managed by GNU Guix.

** Theme
