.files/.config/emacs/init.el
;; -*- lexical-binding: t; -*-

          ;;; This file is generated from the =emacs.org= file in my dotfiles repository!
          ;;; ----- Basic Configuration -----

(setq read-process-output-max (* 1024 1024))  ;; 1MB
(setq process-adaptive-read-buffering nil)

;; Increase the garbage collection threshold during startup for faster startup
(setq gc-cons-threshold most-positive-fixnum)

;; Reset garbage collection thresholds after startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 16 1024 1024))  ;; 16MB
            (setq gc-cons-percentage 0.1)))

(set-language-environment "UTF-8")
(setq locale-coding-system 'utf-8)

(setq network-enable-ipv6 nil)
(setq starttls-use-gnutls t
      starttls-gnutls-program "gnutls-cli")

;; Core settings
(setq visible-bell t                         ;; Flash the screen instead of beeping
      inhibit-startup-message t              ;; Suppress the startup message
      inhibit-startup-screen t               ;; Disable the startup screen
      initial-scratch-message ";; Welcome to Emacs!\n\n"  ;; Set the scratch message
      make-backup-files nil                  ;; Disable backup files
      auto-save-default nil                  ;; Disable auto-saving to backup files
      ad-redefinition-action 'accept         ;; Silence function redefinition warnings
      ring-bell-function 'ignore             ;; Disable the bell completely
      vc-follow-symlinks t                   ;; Always follow symlinks
      large-file-warning-threshold nil       ;; Disable large file warnings
      custom-file (expand-file-name "custom.el" user-emacs-directory) ;; Set custom file
      frame-title-format
      '((:eval (if (buffer-file-name)
                   (abbreviate-file-name (buffer-file-name))
                 "%b")))                     ;; Show full path in frame title
      )

;; Load the custom file if it exists
(when (file-exists-p custom-file)
  (load custom-file t))

;; Set default encoding to UTF-8
(prefer-coding-system 'utf-8)

;; Set tabs to spaces and define tab width
(setq-default indent-tabs-mode nil           ;; Use spaces instead of tabs
              tab-width 2)                   ;; Set default tab width to 2

;; Simplify the interface
(menu-bar-mode -1)                           ;; Disable the menu bar
(tool-bar-mode -1)                           ;; Disable the tool bar
(scroll-bar-mode -1)                         ;; Disable the scroll bar

;; (fset 'geiser-xref-backend (lambda (&rest _) nil))

;; (with-eval-after-load 'xref
;;   (remove-hook 'xref-backend-functions #'geiser-xref-backend))

;; (with-eval-after-load 'geiser
;;   (add-hook 'geiser-mode-hook
;;             (lambda ()
;;               (setq-local xref-backend-functions
;;                           (remq 'geiser-xref-backend xref-backend-functions)))))

;; (with-eval-after-load 'geiser
;;   (add-hook 'geiser-mode-hook
;;             (lambda ()
;;               (add-hook 'xref-backend-functions #'geiser-xref-backend nil t))))


(setenv "PATH" (concat (getenv "HOME") "/.local/bin:" (getenv "PATH")))
(add-to-list 'exec-path (expand-file-name "~/.local/bin"))

  ;; Core modes
  (repeat-mode 1)                              ;; Enable repeat mode
  (savehist-mode 1)                            ;; Save minibuffer history
  (save-place-mode 1)                          ;; Remember cursor positions in files
  (recentf-mode 1)                             ;; Enable recent files mode
  (which-key-mode 1)                           ;; Enable which-key mode (if installed)
  (column-number-mode 1)                       ;; Show column numbers
  (display-time-mode 1)                        ;; Display time in mode line
  (global-visual-line-mode 1)                  ;; Wrap long lines visually
  (xterm-mouse-mode 1)                         ;; Enable mouse support in terminal
  (auto-save-visited-mode 1)                   ;; Auto-save files at intervals
  (tab-bar-history-mode 1)                     ;; Enable tab bar history
  (global-auto-revert-mode 1)                  ;; Refresh buffers when files change

  ;; Display line numbers in programming modes
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)

  ;; Set default directory to home
  (setq default-directory "~/")

  ;; Fix locale settings (if needed)
  (when (and (not (getenv "LC_ALL"))
             (or (not (getenv "LANG"))
                 (string= (getenv "LANG") "")))
    (setenv "LANG" "en_US.UTF-8"))

  ;; -*- lexical-binding: t; -*-

  ;;; This file is generated from the =emacs.org= file in my dotfiles repository!

  ;;; ----- Basic Configuration -----

  ;; Core settings
  (setq visible-bell t                        ;; Flash the UI instead of beeping
        inhibit-startup-message t             ;; Yes, this is emacs
        auto-save-default nil                 ;; Save to the current file, not a backup file
        make-backup-files nil                 ;; No backup files, please
        large-file-warning-threshold nil      ;; Don't warn on large files
        ad-redefinition-action 'accept        ;; Don't warn on advice
        global-auto-revert-non-file-buffers t ;; Revert Dired and other buffers
        )

    ;; Tabs to spaces
    (setq-default indent-tabs-mode nil
                  tab-width 2)

    ;; Display line numbers in programming modes
    (add-hook 'prog-mode-hook #'display-line-numbers-mode)

    ;; Delete trailing whitespace before saving buffers
    (add-hook 'before-save-hook 'delete-trailing-whitespace)

    ;; Move customization settings out of init.el
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (when (file-exists-p custom-file)
      (load custom-file t))
