emacs.org
*** Base theme
We'll use the =nano-theme= to achieve a minimalist look similar to the Nano editor. Since you're managing packages with Guix, we'll set =:ensure nil= in =use-package= declarations to avoid installing packages via =package.el=.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(use-package doom-themes
  :ensure nil
  :config
  ;; Load doom-dracula theme
  (load-theme 'doom-dracula t)

  ;; Enable doom-themes features
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification
  (doom-themes-org-config))
#+end_src

*** ANSI Colors
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (require 'ansi-color)
  (defun my/compilation-ansi-colorize ()
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region compilation-filter-start (point))))
  (add-hook 'compilation-filter-hook #'my/compilation-ansi-colorize)
#+end_src

*** COMMENT Enable Nano Mode

=nano-theme= works best with =nano-modeline= and =nano-layout=. We'll enable =nano-modeline= to adjust the mode line for a Nano-like appearance.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable nano-modeline for a minimalist mode line
  (use-package nano-modeline
    :ensure nil
    :config
    (add-hook 'prog-mode-hook            'nano-modeline-prog-mode)
    (add-hook 'text-mode-hook            'nano-modeline-text-mode)
    (add-hook 'org-mode-hook             'nano-modeline-org-mode)
    (add-hook 'pdf-view-mode-hook        'nano-modeline-pdf-mode)
    (add-hook 'mu4e-headers-mode-hook    'nano-modeline-mu4e-headers-mode)
    (add-hook 'mu4e-view-mode-hook       'nano-modeline-mu4e-message-mode)
    (add-hook 'elfeed-show-mode-hook     #'nano-modeline-elfeed-entry-mode)
    (add-hook 'elfeed-search-mode-hook   #'nano-modeline-elfeed-search-mode)
    (add-hook 'term-mode-hook            'nano-modeline-term-mode)
    (add-hook 'xwidget-webkit-mode-hook  #'nano-modeline-xwidget-mode)
    (add-hook 'messages-buffer-mode-hook 'nano-modeline-message-mode)
    (add-hook 'org-capture-mode-hook     'nano-modeline-org-capture-mode)
    (add-hook 'org-agenda-mode-hook      'nano-modeline-org-agenda-mode))
#+end_src

*** Font Configuration

Set up fonts to match Doom Emacs's style, using =JetBrains Mono= for fixed-pitch (monospace) text and =Iosevka Aile= for variable-pitch text.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

;; Font configurations - universal for GUI and terminal
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :height 110
                    :weight 'normal)

(set-face-attribute 'fixed-pitch nil
                    :font "Fira Code Retina"
                    :weight 'normal)

(set-face-attribute 'variable-pitch nil
                    :font "Cantarell"
                    :weight 'normal)

;; Ensure line numbers scale with text
(set-face-attribute 'line-number nil
                    :inherit 'default)
(set-face-attribute 'line-number-current-line nil
                    :inherit 'line-number
                    :weight 'bold)

;; Fix Org Agenda scaling
(with-eval-after-load 'org-agenda
  (set-face-attribute 'org-agenda-structure nil
                      :inherit 'default
                      :height 1.0))

;; Fix Dashboard scaling
(with-eval-after-load 'dashboard
  (set-face-attribute 'dashboard-heading nil
                      :inherit 'default
                      :weight 'bold
                      :height 1.0)
  (set-face-attribute 'dashboard-items-face nil
                      :inherit 'default))

;; Frame transparency (GUI only feature, but won't error in terminal)
(set-frame-parameter (selected-frame) 'alpha 95)
(add-to-list 'default-frame-alist '(alpha . 95))
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
(add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

*** Frame Transparency and Maximization

Adjust frame transparency and maximize the frame on startup for a polished look.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

  ;; Frame transparency and maximization
  (when (display-graphic-p)
    ;; Set frame transparency
    (set-frame-parameter (selected-frame) 'alpha 95)
    (add-to-list 'default-frame-alist '(alpha . 95))

    ;; Maximize the frame on startup
    (add-to-list 'initial-frame-alist '(fullscreen . maximized))
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

#+end_src

*** Terminal Compatibility

Ensure that Emacs behaves correctly when running in a terminal by clearing the background color.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; ;; Adjust settings for terminal Emacs
  ;; (unless (display-graphic-p)
  ;;   ;; Clear background color for transparent terminals
  ;;   (set-face-background 'default "unspecified-bg"))
#+end_src

*** COMMENT Simplify the Mode Line

To achieve a minimalist look, we'll simplify the mode line.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Simplify the mode line
  (setq-default mode-line-format
                '("%e"
                  mode-line-front-space
                  "%b"           ; Buffer name
                  " [%*] "       ; Modification status
                  "("
                  mode-line-position
                  ") "
                  mode-line-modes
                  mode-line-end-spaces))
#+end_src

*** Additional Enhancements

While =nano-theme= and =nano-modeline= handle most of the appearance, you might want to include additional packages like =all-the-icons= for better visuals in modes like Dired.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Load all-the-icons without installing via package.el
  (use-package all-the-icons
    :ensure nil)
#+end_src

We adjust the tab-bar for display with a minimalist theme

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Tweak the tab bar to match the minimalist theme
  (setq tab-bar-close-button-show nil
        tab-bar-new-button-show nil
        tab-bar-separator " | "
        tab-bar-format '(tab-bar-format-tabs
                         tab-bar-separator
                         tab-bar-format-align-right))

  ;; Enable the tab bar
  (tab-bar-mode 1)
#+end_src


Set the frame title to display the current buffer or file name, which is helpful when working with multiple files.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Set the frame title to show the buffer or file name
  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))))
#+end_src

* Evil-mode

To bring the powerful and efficient modal editing experience of Vim to Emacs, we'll enable *Evil Mode*. Additionally, we'll incorporate several enhancements inspired by /Doom Emacs/ to provide a seamless and feature-rich editing environment. Our configuration will include:

- *Evil Mode*: The core package providing Vim emulation.
- *Evil Collection*: A collection of keybindings for various Emacs modes to work seamlessly with Evil.
- *Evil Surround*: Provides Vim's surround text objects.
- *Evil Commentary*: Enables easy commenting of code using Vim-like motions.
- *Evil Goggles*: Adds visual hints for Evil operations like yank, delete, paste, etc.
- *Evil Matchit*: Allows jumping between matched tags, similar to Vim's =%= motion.
- *Undo-Fu*: A simple and efficient undo/redo system for Emacs.

** Enable Evil Mode

First, we'll enable Evil Mode, ensuring that it's loaded correctly and set up with necessary configurations:

- =evil-want-keybinding=: Set to =nil= to prevent Evil from loading its default keybindings, allowing Evil Collection to manage them.
- =evil-undo-system=: We set this to ='undo-fu= to use the =undo-fu= package for more intuitive undo/redo behavior.
- =(evil-mode 1)=: Activates Evil Mode globally.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el


  ;; Enable Evil Mode
  (use-package evil
    :ensure nil
    :init
    (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-d-scroll t
        evil-want-C-i-jump nil
        evil-vsplit-window-right t
        evil-split-window-below t
        evil-respect-visual-line-mode t
        evil-undo-system 'undo-fu
        evil-search-module 'evil-search    ;; ADD here
        evil-want-fine-undo t              ;; ADD here
        evil-kill-on-visual-paste nil)
    :config
    ;; Enable Evil Mode
    (evil-mode 1))

#+end_src

** Enhance Evil Mode with Evil Collection

Evil Collection provides comprehensive Evil keybindings for various built-in and third-party Emacs modes.

- =:after evil=: Ensures that Evil is loaded before Evil Collection.
- =(evil-collection-init)=: Initializes Evil Collection, applying Evil keybindings to supported modes.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

(use-package evil-collection
  :after evil
  :ensure nil
  :config
  ;; Initialize Evil Collection for all supported modes
  (evil-collection-init))

#+end_src

** Add Evil Escape

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(use-package evil-escape
  :ensure nil
  :after evil
  :config
  (evil-escape-mode 1)
  (setq-default evil-escape-key-sequence "jk"
                evil-escape-delay 0.15))
#+end_src

** Add Evil Surround

Evil Surround allows you to easily modify surrounding characters like brackets, quotes, etc., emulating Vim's =surround.vim= plugi:

- =(global-evil-surround-mode 1)=: Enables Evil Surround globally.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Add Evil Surround
  (use-package evil-surround
    :ensure nil
    :config
    (global-evil-surround-mode 1))
#+end_src

** Enable Evil Commentary

Evil Commentary provides Vim-like commenting functionality using =gc= as the prefix:

- =(evil-commentary-mode)=: Activates Evil Commentary.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable Evil Commentary
  (use-package evil-commentary
    :ensure nil
    :config
    (evil-commentary-mode))
#+end_src

** Add Visual Feedback with Evil Goggles

Evil Goggles adds visual hints to Evil operations, making it easier to see what changes are being made:

- =(evil-goggles-mode)=: Enables Evil Goggles.
- =(evil-goggles-use-diff-faces)=: Uses faces from =diff-mode= for a consistent look.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Add Visual Feedback with Evil Goggles
  (use-package evil-goggles
    :ensure nil
    :config
    (evil-goggles-mode)
    ;; Optional: Use diff-mode faces
    (evil-goggles-use-diff-faces))
#+end_src

** Enable Evil Matchit

Evil Matchit allows you to jump between matching tags, parentheses, braces, etc., using the =%= key, similar to Vim's functionality:

- =(global-evil-matchit-mode 1)=: Activates Evil Matchit globally.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable Evil Matchit
  (use-package evil-matchit
    :ensure nil
    :config
    (global-evil-matchit-mode 1))
#+end_src

