.files/.config/emacs/init.el

(use-package doom-themes
  :ensure nil
  :config
  ;; Load doom-dracula theme
  (load-theme 'doom-dracula t)

  ;; Enable doom-themes features
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification
  (doom-themes-org-config))

  (require 'ansi-color)
  (defun my/compilation-ansi-colorize ()
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region compilation-filter-start (point))))
  (add-hook 'compilation-filter-hook #'my/compilation-ansi-colorize)

;; Font configurations - universal for GUI and terminal
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :height 110
                    :weight 'normal)

(set-face-attribute 'fixed-pitch nil
                    :font "Fira Code Retina"
                    :weight 'normal)

(set-face-attribute 'variable-pitch nil
                    :font "Cantarell"
                    :weight 'normal)

;; Ensure line numbers scale with text
(set-face-attribute 'line-number nil
                    :inherit 'default)
(set-face-attribute 'line-number-current-line nil
                    :inherit 'line-number
                    :weight 'bold)

;; Fix Org Agenda scaling
(with-eval-after-load 'org-agenda
  (set-face-attribute 'org-agenda-structure nil
                      :inherit 'default
                      :height 1.0))

;; Fix Dashboard scaling
(with-eval-after-load 'dashboard
  (set-face-attribute 'dashboard-heading nil
                      :inherit 'default
                      :weight 'bold
                      :height 1.0)
  (set-face-attribute 'dashboard-items-face nil
                      :inherit 'default))

;; Frame transparency (GUI only feature, but won't error in terminal)
(set-frame-parameter (selected-frame) 'alpha 95)
(add-to-list 'default-frame-alist '(alpha . 95))
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
(add-to-list 'default-frame-alist '(fullscreen . maximized))

  ;; Frame transparency and maximization
  (when (display-graphic-p)
    ;; Set frame transparency
    (set-frame-parameter (selected-frame) 'alpha 95)
    (add-to-list 'default-frame-alist '(alpha . 95))

    ;; Maximize the frame on startup
    (add-to-list 'initial-frame-alist '(fullscreen . maximized))
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

  ;; ;; Adjust settings for terminal Emacs
  ;; (unless (display-graphic-p)
  ;;   ;; Clear background color for transparent terminals
  ;;   (set-face-background 'default "unspecified-bg"))

  ;; Load all-the-icons without installing via package.el
  (use-package all-the-icons
    :ensure nil)

  ;; Tweak the tab bar to match the minimalist theme
  (setq tab-bar-close-button-show nil
        tab-bar-new-button-show nil
        tab-bar-separator " | "
        tab-bar-format '(tab-bar-format-tabs
                         tab-bar-separator
                         tab-bar-format-align-right))

  ;; Enable the tab bar
  (tab-bar-mode 1)

  ;; Set the frame title to show the buffer or file name
  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))))

  ;; Enable Evil Mode
  (use-package evil
    :ensure nil
    :init
    (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-d-scroll t
        evil-want-C-i-jump nil
        evil-vsplit-window-right t
        evil-split-window-below t
        evil-respect-visual-line-mode t
        evil-undo-system 'undo-fu
        evil-search-module 'evil-search    ;; ADD here
        evil-want-fine-undo t              ;; ADD here
        evil-kill-on-visual-paste nil)
    :config
    ;; Enable Evil Mode
    (evil-mode 1))

(use-package evil-collection
  :after evil
  :ensure nil
  :config
  ;; Initialize Evil Collection for all supported modes
  (evil-collection-init))

(use-package evil-escape
  :ensure nil
  :after evil
  :config
  (evil-escape-mode 1)
  (setq-default evil-escape-key-sequence "jk"
                evil-escape-delay 0.15))

  ;; Add Evil Surround
  (use-package evil-surround
    :ensure nil
    :config
    (global-evil-surround-mode 1))

  ;; Enable Evil Commentary
  (use-package evil-commentary
    :ensure nil
    :config
    (evil-commentary-mode))

  ;; Add Visual Feedback with Evil Goggles
  (use-package evil-goggles
    :ensure nil
    :config
    (evil-goggles-mode)
    ;; Optional: Use diff-mode faces
    (evil-goggles-use-diff-faces))

  ;; Enable Evil Matchit
  (use-package evil-matchit
    :ensure nil
    :config
    (global-evil-matchit-mode 1))
