emacs.org
** Use Undo-Fu for Enhanced Undo/Redo

Undo-Fu provides an intuitive and reliable undo/redo system, improving upon Emacs's default behavior. We don't need additional configuration here because we set =evil-undo-system= to ='undo-fu= earlier.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Use Undo-Fu for Enhanced Undo/Redo
  (use-package undo-fu
    :ensure nil)
#+end_src

** COMMENT Configure Evil Snipe

Evil Snipe provides Vim's =s= and =S= motions for quick navigation:

- =(evil-snipe-mode 1)= and =(evil-snipe-override-mode 1)=: Activates Evil Snipe and overrides default keybindings.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package evil-snipe
    :ensure nil
    :config
    (evil-snipe-mode 1)
    (evil-snipe-override-mode 1))
#+end_src

** Integrate Evil with Paredit for Lisp Editing

When working with Lisp languages, integrating Evil with Paredit enhances structural editing.

- =:after (evil paredit)=: Ensures that Evil and Paredit are loaded before Evil Paredit.
- =:hook=: Automatically enables =evil-paredit-mode= in specified modes.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Integrate Evil with Paredit for Lisp Editing
  (use-package evil-paredit
    :ensure nil
    :after (evil paredit)
    :hook
    ((emacs-lisp-mode lisp-mode scheme-mode) . evil-paredit-mode))
#+end_src

** Customize Cursor Appearance in Different Modes

Adjust the cursor appearance to reflect the current Evil state.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Customize Cursor Appearance
  (setq evil-normal-state-cursor 'box      ;; Normal mode cursor is a box
        evil-insert-state-cursor 'bar      ;; Insert mode cursor is a bar
        evil-visual-state-cursor 'hollow)  ;; Visual mode cursor is hollow
#+end_src

** Evil Org Mode Integration

Integrating Evil with Org Mode provides better keybindings:

- =evil-org-mode=: Enhances Evil integration in Org Mode.
- =evil-org-agenda-set-keys=: Sets up Evil keybindings in Org Agenda.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Evil Org Mode Integration
  (use-package evil-org
    :ensure nil
    :after (evil org)
    :hook (org-mode . evil-org-mode)
    :config
    (add-hook 'org-mode-hook #'evil-org-mode)
    (require 'evil-org-agenda)
    (evil-org-set-key-theme '(navigation insert textobjects additional))
    (evil-org-agenda-set-keys))
#+end_src

* Org-mode Configuration

To enhance our Org Mode experience with a modern look and conveniences similar to Doom Emacs, we'll configure several packages and settings. We'll focus on improving the appearance and usability of Org documents while keeping the configuration clean and organized.

Our goals are:

- *Visual Enhancements*: Use =org-modern= to modernize the look of Org files.
- *Readability Improvements*: Implement =variable-pitch-mode= and =visual-fill-column-mode= for better text readability.
- *Functional Enhancements*: Configure Org Babel for code blocks and integrate with Evil Mode for efficient navigation.
- *Organization*: Write the configuration as a literate configuration with appropriate sections and explanations.

*Note*: Since we're using =org-modern=, we don't need to use =org-superstar= or =org-bullets= as =org-modern= provides similar functionalities and more.

** Modernizing Org Appearance with =org-modern=

=org-modern= is a package that revamps the look of Org documents by improving the styling of headlines, lists, checkboxes, links, tables, and more. It replaces packages like =org-bullets= and =org-superstar=, so we don't need to use them together.

- *Installation*: Since we are managing packages with Guix, we'll use =:ensure nil= in =use-package= declarations.
- *Configuration*: We'll enable =org-modern-mode= to apply =org-modern= styling to Org buffers.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

;; Org Mode base configuration (Doom defaults)
(use-package org
  :ensure nil
  :config
  (setq org-startup-indented t
        org-startup-folded 'content
        org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-preserve-indentation t
        org-log-done 'time
        org-fontify-whole-heading-line t
        org-fontify-done-headline t
        org-fontify-quote-and-verse-blocks t))

;; Enhance Org Mode appearance with org-modern
(use-package org-modern
  :after (org)
  :ensure nil
  :hook
  (org-mode . org-modern-mode)
  :config
  ;; Enable org-modern globally for all Org buffers
  (global-org-modern-mode))

#+end_src

** COMMENT Enhancing Text Layout with =visual-fill-column=

=visual-fill-column-mode= centers the text and sets a maximum text width, providing a pleasant reading experience similar to modern word processors.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enhance text layout with visual-fill-column
  (use-package visual-fill-column
    :after (org)
    :ensure nil
    :hook (org-mode . visual-fill-column-mode)
    :config
    (setq visual-fill-column-width 100  ;; Set text width
          visual-fill-column-center-text t))  ;; Center the text
#+end_src

** COMMENT Customizing Org Mode Appearance

Adjust various Org settings for a cleaner and more modern look.

- *Hide Markup*: Conceal emphasis markers (e.g., =*=, =/=, ===) in Org documents.
- *Use Pretty Entities*: Replace entities like =-->= with actual arrows.
- *Adjust Ellipsis*: Change the folding ellipsis to a more subtle character.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Customize Org Mode appearance
  (setq org-hide-emphasis-markers t       ;; Hide *, /, etc.
        org-pretty-entities t             ;; Replace entities with symbols
        org-ellipsis "⤵")                ;; Ellipsis for folded content

  (defun my/org-mode-setup ()
    "Custom configurations for Org Mode."
    ;; Get the default face height
    (let ((base-height (face-attribute 'default :height)))
      (dolist (face-scale '((org-level-1 . 1.3)
                            (org-level-2 . 1.2)
                            (org-level-3 . 1.1)
                            (org-level-4 . 1.0)
                            (org-level-5 . 1.0)))
        (let ((face (car face-scale))
              (scale (cdr face-scale)))
          (set-face-attribute face nil
                              :family "Iosevka Aile"
                              :weight 'regular
                              :height (truncate (* base-height scale)))))
      (require 'org-reveal)))

  (add-hook 'org-mode-hook 'my/org-mode-setup)
#+end_src

** Enabling Org Indent Mode

=org-indent-mode= visually indents text according to the outline structure, improving readability.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable Org Indent Mode for better alignment
  (add-hook 'org-mode-hook 'org-indent-mode)
#+end_src

** Enhancing Folding with =org-appear=

=org-appear= makes hidden emphasis markers visible when the cursor is over them, providing context without cluttering the view.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Use org-appear to show hidden emphasis markers on cursor
  (use-package org-appear
    :after (org)
    :ensure nil
    :hook (org-mode . org-appear-mode)
    :config
    (setq org-appear-autolinks t
          org-appear-autosubmarkers t
          org-appear-autoentities t
          org-appear-autokeywords t
          org-appear-delay 0.5))
#+end_src

** Configuring Org Babel for Code Blocks

Enable the execution of code blocks in various languages and ensure safe execution.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Configure Org Babel languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (python . t)
     (latex . t)
     (C . t)
     (mermaid . t)
     (dot . t)))

  ;; Don't ask for confirmation before executing code blocks
  (setq org-confirm-babel-evaluate nil)
#+end_src

** Setting Up LaTeX Export with Minted

Configure Org Mode to use =minted= for syntax highlighting in LaTeX exports.

- *Prerequisites*: Ensure that LaTeX is configured to use =minted=, which requires the =-shell-escape= option and the =pygments= package installed.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; LaTeX export settings using minted
  (setq org-latex-listings 'minted
        org-latex-packages-alist '(("" "minted"))
        org-latex-minted-options
        '(("frame" "lines")
          ("fontsize" "\\scriptsize")
          ("linenos" "true")))
#+end_src

** Setting Up org-capture templates

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (setq org-capture-templates
        '(("t" "TODO workflow")
          ("tt" "Work Todo" entry (file+olp "~/org/inbox.org" "Inbox")
           "* TODO %?\nEntered on %U\n  %i\n\n")
          ("tp" "Personal Todo" entry (file+olp "~/org/inbox-personal.org" "Inbox")
           "* TODO %? :personal:\nEntered on %U\n  %i\n\n")
          ("m" "Email Workflow")
          ("mf" "Follow Up" entry (file+olp "~/org/inbox.org" "E-Mail")
           "* TODO Follow up with %:fromname on [[%:link][%:subject]]
      SCHEDULED: %t
      DEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))

      %i" :immediate-finish nil)
          ("mr" "Reply" entry (file+olp "~/org/inbox.org" "E-Mail")
           "* TODO [#A] Reply to %:fromname on [[%:link][%:subject]]
      SCHEDULED: %t
      DEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))

      %i" :immediate-finish nil)))
  #+end_src
** Org-agenda files
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (setq org-agenda-files '("~/org/inbox.org"
                           "~/org/archive.org"
                           "~/org/inbox-personal.org"
                           "~/org/archive-personal.org"))

  (setq-default org-refile-targets '((nil :maxlevel . 9)
                                     (org-agenda-files :maxlevel . 9)))
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path t)
  #+end_src
** Org-mime integration
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package org-mime
    :ensure nil
    :after (mu4e org)
    :config
    ;; Set the default mail user agent to mu4e
    (setq mail-user-agent 'mu4e-user-agent)
    (setq org-mime-preserve-inline-images t)
    ;; Optional: Set default export options for HTML emails
    (setq org-mime-export-options '(:section-numbers nil
                                                     :with-author nil
                                                     :with-toc nil)))
  #+end_src
** Org-babel mermaid integration

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(setq ob-mermaid-cli-path "/home/rafael/node_modules/.bin/mmdc")
#+end_src

* Completion Framework

To enhance ourEmacs experience with a powerful completion system similar to the one employed in Doom Emacs, we'll set up a completion framework using *=ivy=*, *=counsel=*, and *=swiper=*. These packages provide intelligent and efficient completion and search capabilities throughout Emacs.

Our goals are:

- *Efficient Completion*: Use =ivy= for completion in minibuffers and other contexts.
- *Enhanced Commands*: Use =counsel= to augment built-in Emacs commands with =ivy= interfaces.
- *Intuitive Searching*: Use =swiper= for powerful in-buffer searching.
- *Integration with Existing Configuration*: Ensure compatibility with existing settings and avoid conflicts.

