.files/.config/emacs/init.el

  ;; Use Undo-Fu for Enhanced Undo/Redo
  (use-package undo-fu
    :ensure nil)

  ;; Integrate Evil with Paredit for Lisp Editing
  (use-package evil-paredit
    :ensure nil
    :after (evil paredit)
    :hook
    ((emacs-lisp-mode lisp-mode scheme-mode) . evil-paredit-mode))

  ;; Customize Cursor Appearance
  (setq evil-normal-state-cursor 'box      ;; Normal mode cursor is a box
        evil-insert-state-cursor 'bar      ;; Insert mode cursor is a bar
        evil-visual-state-cursor 'hollow)  ;; Visual mode cursor is hollow

  ;; Evil Org Mode Integration
  (use-package evil-org
    :ensure nil
    :after (evil org)
    :hook (org-mode . evil-org-mode)
    :config
    (add-hook 'org-mode-hook #'evil-org-mode)
    (require 'evil-org-agenda)
    (evil-org-set-key-theme '(navigation insert textobjects additional))
    (evil-org-agenda-set-keys))

;; Org Mode base configuration (Doom defaults)
(use-package org
  :ensure nil
  :config
  (setq org-startup-indented t
        org-startup-folded 'content
        org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-preserve-indentation t
        org-log-done 'time
        org-fontify-whole-heading-line t
        org-fontify-done-headline t
        org-fontify-quote-and-verse-blocks t))

;; Enhance Org Mode appearance with org-modern
(use-package org-modern
  :after (org)
  :ensure nil
  :hook
  (org-mode . org-modern-mode)
  :config
  ;; Enable org-modern globally for all Org buffers
  (global-org-modern-mode))

  ;; Enable Org Indent Mode for better alignment
  (add-hook 'org-mode-hook 'org-indent-mode)

  ;; Use org-appear to show hidden emphasis markers on cursor
  (use-package org-appear
    :after (org)
    :ensure nil
    :hook (org-mode . org-appear-mode)
    :config
    (setq org-appear-autolinks t
          org-appear-autosubmarkers t
          org-appear-autoentities t
          org-appear-autokeywords t
          org-appear-delay 0.5))

  ;; Configure Org Babel languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (python . t)
     (latex . t)
     (C . t)
     (mermaid . t)
     (dot . t)))

  ;; Don't ask for confirmation before executing code blocks
  (setq org-confirm-babel-evaluate nil)

  ;; LaTeX export settings using minted
  (setq org-latex-listings 'minted
        org-latex-packages-alist '(("" "minted"))
        org-latex-minted-options
        '(("frame" "lines")
          ("fontsize" "\\scriptsize")
          ("linenos" "true")))

  (setq org-capture-templates
        '(("t" "TODO workflow")
          ("tt" "Work Todo" entry (file+olp "~/org/inbox.org" "Inbox")
           "* TODO %?\nEntered on %U\n  %i\n\n")
          ("tp" "Personal Todo" entry (file+olp "~/org/inbox-personal.org" "Inbox")
           "* TODO %? :personal:\nEntered on %U\n  %i\n\n")
          ("m" "Email Workflow")
          ("mf" "Follow Up" entry (file+olp "~/org/inbox.org" "E-Mail")
           "* TODO Follow up with %:fromname on [[%:link][%:subject]]
      SCHEDULED: %t
      DEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))

      %i" :immediate-finish nil)
          ("mr" "Reply" entry (file+olp "~/org/inbox.org" "E-Mail")
           "* TODO [#A] Reply to %:fromname on [[%:link][%:subject]]
      SCHEDULED: %t
      DEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))

      %i" :immediate-finish nil)))

  (setq org-agenda-files '("~/org/inbox.org"
                           "~/org/archive.org"
                           "~/org/inbox-personal.org"
                           "~/org/archive-personal.org"))

  (setq-default org-refile-targets '((nil :maxlevel . 9)
                                     (org-agenda-files :maxlevel . 9)))
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path t)

  (use-package org-mime
    :ensure nil
    :after (mu4e org)
    :config
    ;; Set the default mail user agent to mu4e
    (setq mail-user-agent 'mu4e-user-agent)
    (setq org-mime-preserve-inline-images t)
    ;; Optional: Set default export options for HTML emails
    (setq org-mime-export-options '(:section-numbers nil
                                                     :with-author nil
                                                     :with-toc nil)))

(setq ob-mermaid-cli-path "/home/rafael/node_modules/.bin/mmdc")
