emacs.org
** Setting Up Ivy

*=ivy=* is a generic completion mechanism for Emacs. It replaces built-in completion methods with a more flexible and efficient system. We'll enable =ivy= globally and fine-tune its settings for better usability.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable Ivy for enhanced completion
(use-package ivy
  :ensure nil
  :demand t
  :diminish
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers nil          ; Changed from t - no virtual buffers
        ivy-count-format "(%d/%d) "
        ivy-wrap t
        ivy-height 15
        ivy-fixed-height-minibuffer t
        ivy-ignore-buffers nil)              ; Let perspective handle filtering
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)))
#+end_src


** Enhancing Commands with Counsel

*=counsel=* provides =ivy=-enhanced versions of common Emacs commands, integrating =ivy= into many aspects of Emacs.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Use Counsel to enhance built-in Emacs commands
  (use-package counsel
    :ensure nil
    :demand t
    :after ivy
    :config
    (counsel-mode 1)
    ;; Replace some default commands with counsel alternatives
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x b") 'counsel-switch-buffer)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    ;; Additional keybindings for counsel commands
    (global-set-key (kbd "C-c k") 'counsel-rg)          ;; Ripgrep search
    (global-set-key (kbd "C-c g") 'counsel-git)         ;; Git files
    (global-set-key (kbd "C-c j") 'counsel-git-grep)    ;; Git grep
    (global-set-key (kbd "C-c L") 'counsel-load-library))
#+end_src

** In-Buffer Searching with Swiper

*=swiper=* offers an =ivy=-powered alternative to =isearch= for in-buffer searching, providing an interactive search experience.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enable Swiper for improved in-buffer searching
  (use-package swiper
    :ensure nil
    :after ivy
    :bind (("C-s" . swiper)             ;; Replace default search with swiper
           ("C-r" . swiper)))           ;; Replace reverse search
#+end_src

** Ivy Rich

*=ivy-rich=* provides additional information in =ivy= completion lists, making it easier to distinguish between candidates.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Enhance Ivy with ivy-rich
  (use-package ivy-rich
    :ensure nil
    :after ivy
    :init
    (ivy-rich-mode 1))
#+end_src

* Keybindings Configuration with =general.el=

To bring the convenience of Doom Emacs's keybinding system into our configuration, we'll use the =general.el= package. It allows for easy and readable keybinding definitions, especially when setting up leader keys and prefixes. This will help us create a coherent and organized keybinding scheme that mirrors Doom Emacs's =[SPC]= leader key setup.

Our goals are:

- Set up =general.el= in your configuration.
- Define =SPC= as the leader key.

** Installing and Configuring =general.el=
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Load general.el for keybinding management
  (use-package general
  :ensure nil
  :config
  ;; Set up 'SPC' as the leader key with precedence over minor modes
  (general-create-definer my/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override                 ;; Ensure it has precedence
    :prefix "SPC"
    :non-normal-prefix "M-SPC")
  ;; Additional keybindings
  (general-define-key
   :states '(normal insert visual emacs)
   :keymaps 'override
   "C-+" 'text-scale-increase
   "C-=" 'text-scale-increase
   "C--" 'text-scale-decrease
   "C-0" '(text-scale-set :which-key "Reset text scale")))

#+end_src
** Defining Keybindings

Now we'll define keybindings that correspond to the functionalities we've enabled. We'll emulate Doom Emacs' keybinding conventions where possible.

*** Basic Keybindings

Define common keybindings for frequently used commands.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Basic keybindings
  (my/leader-keys
    "SPC" '(counsel-M-x :which-key "M-x")
    "f"   '(:ignore t :which-key "Files")
    "ff"  '(counsel-find-file :which-key "Find file")
    "fs"  '(save-buffer :which-key "Save buffer")
    "fr"  '(counsel-recentf :which-key "Recent files")
    "fS"  '(write-file :which-key "Save file as...")
    "w"   '(:ignore t :which-key "Windows")
    "wd"  '(delete-window :which-key "Delete window")
    "wo"  '(delete-other-windows :which-key "Delete other windows")
    "ws"  '(split-window-below :which-key "Split window below")
    "wv"  '(split-window-right :which-key "Split window right")
    ;;"TAB" '(:ignore t :which-key "Tabs")
    ;;"TAB" '(switch-to-prev-buffer :which-key "Previous buffer")
    "u"   '(universal-argument :which-key "Universal argument")
    "q"   '(:ignore t :which-key "Quit/Restart")
    "qq"  '(save-buffers-kill-terminal :which-key "Quit Emacs"))

  ;; Text manipulation (Doom-style)
  (my/leader-keys
    "x"   '(:ignore t :which-key "text")
    "xa"  '(align-regexp :which-key "Align")
    "xl"  '(downcase-region :which-key "Downcase")
    "xu"  '(upcase-region :which-key "Upcase")
    "xc"  '(capitalize-region :which-key "Capitalize")
    "xw"  '(delete-trailing-whitespace :which-key "Delete trailing whitespace")
    "xs"  '(sort-lines :which-key "Sort lines"))

  ;; Toggle bindings (more complete)
  (my/leader-keys
    "t"   '(:ignore t :which-key "toggle")
    "tl"  '(display-line-numbers-mode :which-key "Line numbers")
    "tf"  '(toggle-frame-fullscreen :which-key "Fullscreen")
    "tw"  '(whitespace-mode :which-key "Whitespace")
    "tt"  '(toggle-truncate-lines :which-key "Truncate lines")
    "tv"  '(visual-line-mode :which-key "Visual line mode")
    "ts"  '(flyspell-mode :which-key "Spell check"))

  ;; Insert bindings
  (my/leader-keys
    "i"   '(:ignore t :which-key "insert")
    "iy"  '(counsel-yank-pop :which-key "From kill ring")
    "is"  '(yas-insert-snippet :which-key "Snippet")
    "iu"  '(insert-char :which-key "Unicode character"))
#+end_src

*** Searching and Completion

Set up keybindings for =swiper=, =counsel=, and other search-related functionalities.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Search and completion
  (my/leader-keys
    "/"    '(swiper :which-key "Swiper search")
    "s"    '(:ignore t :which-key "Search")
    "sa"   '(swiper-all :which-key "Swiper all buffers")
    "sb"   '(swiper :which-key "Search buffer")
    "sd"   '(counsel-rg :which-key "Ripgrep search")
    "sp"   '(counsel-projectile-rg :which-key "Search project with rg")
    "sg"   '(counsel-git-grep :which-key "Search in Git repo")
    "sr"   '(ivy-resume :which-key "Resume last search")
    )

  (general-define-key
   :states '(normal visual)
   :keymaps 'override
   "SPC s s" '(avy-goto-char :which-key "Avy Goto Char")
   "SPC s w" '(avy-goto-word-1 :which-key "Avy Goto Word")
   "SPC s l" '(avy-goto-line :which-key "Avy Goto Line"))
#+end_src

*** Project Management

Set up keybindings for =projectile= and integrate =counsel-projectile=.

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Ensure counsel-projectile is loaded
  (use-package counsel-projectile
    :ensure nil
    :after (counsel projectile)
    :config
    (counsel-projectile-mode 1))

  ;; Project management
  (my/leader-keys
    "p"   '(:ignore t :which-key "Project")
    "pp"  '(counsel-projectile-switch-project :which-key "Switch project")
    "pf"  '(counsel-projectile-find-file :which-key "Find file in project")
    "pb"  '(counsel-projectile-switch-to-buffer :which-key "Switch buffer in project")
    "pd"  '(projectile-dired :which-key "Project Dired")
    "ps"  '(counsel-projectile-rg :which-key "Search in project")
    "pR"  '(projectile-replace :which-key "Replace in project")
    "pD"  '(projectile-kill-buffers :which-key "Kill project buffers")
    "pc"  '(projectile-compile-project :which-key "Compile project")
    "pC"  '(projectile-configure-project :which-key "Configure project")
    )
#+end_src

