.files/.config/emacs/init.el

  ;; Window and buffer navigation
  (my/leader-keys
    "w"   '(:ignore t :which-key "Windows")
    "wh"  '(evil-window-left :which-key "Window left")
    "wl"  '(evil-window-right :which-key "Window right")
    "wk"  '(evil-window-up :which-key "Window up")
    "wj"  '(evil-window-down :which-key "Window down")
    "w/"  '(split-window-right :which-key "Split window right")
    "w-"  '(split-window-below :which-key "Split window below")
    "w="  '(balance-windows :which-key "Balance windows")
    "wm"  '(delete-other-windows :which-key "Maximize window")
    "wd"  '(delete-window :which-key "Delete window")
    "ww"  '(other-window :which-key "Other window")
    ;;"TAB" '(mode-line-other-buffer :which-key "Switch to last buffer")
    "b"   '(:ignore t :which-key "Buffers")
    "bn"  '(next-buffer :which-key "Next buffer")
    "bp"  '(previous-buffer :which-key "Previous buffer")
    "bl"  '(list-buffers :which-key "List buffers")
    )

  ;; Org Mode keybindings
  (my/leader-keys
    "n"   '(:ignore t :which-key "Notes")
    "nn"  '(org-capture :which-key "Org Capture")
    "na"  '(org-agenda :which-key "Org Agenda")
    "nl"  '(org-store-link :which-key "Store org link")
    "nb"  '(org-switchb :which-key "Switch Org buffer")
    )

  ;; Git keybindings
  (my/leader-keys
    "g"   '(:ignore t :which-key "Git")
    "gs"  '(magit-status :which-key "Magit Status")
    "gg"  '(magit-status :which-key "Magit Status")
    "gb"  '(magit-branch-checkout :which-key "Checkout branch")
    "gc"  '(magit-commit :which-key "Commit changes")
    "gC"  '(magit-clone :which-key "Clone repository")
    "gp"  '(magit-push-current :which-key "Push changes")
    "gl"  '(magit-log :which-key "Show log")
    )

  ;; Utility keybindings
  (my/leader-keys
    "t"   '(:ignore t :which-key "Toggle")
    "ts"  '(flyspell-mode :which-key "Toggle Flyspell")
    "tn"  '(display-line-numbers-mode :which-key "Toggle line numbers")
    "tp"  '(visual-line-mode :which-key "Toggle Visual Line Mode"))

  ;; Help and documentation
  (my/leader-keys
    "h"   '(:ignore t :which-key "Help")
    "hf"  '(describe-function :which-key "Describe function")
    "hv"  '(describe-variable :which-key "Describe variable")
    "hk"  '(describe-key :which-key "Describe key")
    "hm"  '(describe-mode :which-key "Describe mode")
    "ho"  '(counsel-describe-symbol :which-key "Describe symbol")
    "hi"  '(info :which-key "Info manuals")
    )

  ;; Code and development tools
  (my/leader-keys
    "c"   '(:ignore t :which-key "Code")
    "cc"  '(compile :which-key "Compile")
    "cr"  '(recompile :which-key "Recompile")
    "cs"  '(counsel-imenu :which-key "Search symbols")
    "cd"  '(xref-find-definitions :which-key "Find definitions")
    "cD"  '(xref-find-references :which-key "Find references")
    "ca"  '(lsp-execute-code-action :which-key "Code action")
    )

  (my/leader-keys
    "TAB" '(:ignore t :which-key "Tabs")
    ;; Reassign 'switch-to-prev-buffer' if desired
    "TAB TAB" '(switch-to-prev-buffer :which-key "Previous buffer")
    "TAB n" '(tab-bar-new-tab :which-key "New Tab")
    "TAB c" '(tab-bar-close-tab :which-key "Close Tab")
    "TAB o" '(tab-bar-switch-to-tab :which-key "Switch to Tab")
    "TAB [" '(tab-bar-switch-to-prev-tab :which-key "Previous Tab")
    "TAB ]" '(tab-bar-switch-to-next-tab :which-key "Next Tab")
    "TAB r" '(tab-bar-rename-tab :which-key "Rename Tab")
    )

  ;; Restart Emacs
  (use-package restart-emacs
    :ensure nil)

  (my/leader-keys
    "qr" '(restart-emacs :which-key "Restart Emacs"))

  (my/leader-keys
    ;; Project bindings
    "p" '(:ignore t :which-key "project")
    "p p" '(projectile-switch-project :which-key "Switch project")
    "p f" '(projectile-find-file :which-key "Find file in project")
    "p b" '(projectile-switch-to-buffer :which-key "Switch to buffer in project")
    "p d" '(projectile-find-dir :which-key "Find directory in project")
    "p s" '(projectile-ripgrep :which-key "Search in project")
    "p g" '(projectile-vc :which-key "Open project in VC")
    "p k" '(projectile-kill-buffers :which-key "Kill project buffers"))

(my/leader-keys
  "TAB" '(:ignore t :which-key "Workspace")
  "TAB TAB" '(persp-switch :which-key "Switch workspace")
  "TAB n" '(persp-switch :which-key "New/switch workspace")
  "TAB d" '(persp-kill :which-key "Delete workspace")
  "TAB r" '(persp-rename :which-key "Rename workspace")
  "TAB [" '(persp-prev :which-key "Previous workspace")
  "TAB ]" '(persp-next :which-key "Next workspace")
  "TAB b" '(persp-switch-to-buffer :which-key "Switch buffer in workspace")
  "TAB p" '(projectile-persp-switch-project :which-key "Project → workspace"))

(use-package projectile
  :ensure nil
  :init
  (projectile-mode +1)
  :config
  ;; Set where projectile looks for projects
  (setq projectile-project-search-path '("~/src/" "~/projects/" "~/"))

  ;; Ensure known projects file location
  (setq projectile-known-projects-file
        (expand-file-name "projectile-bookmarks.eld" user-emacs-directory))

  ;; Auto-discover projects
  (setq projectile-track-known-projects-automatically t)

  ;; Refresh project list on startup
  (projectile-discover-projects-in-search-path))

;; (use-package projectile
;;     :ensure nil
;;     :init
;;     ;; Enable Projectile globally
;;     (projectile-mode +1)
;;     :config
;;     ;; Set Projectile to use the native indexing method
;;     (setq projectile-indexing-method 'native)
;;     ;; Enable caching for faster indexing
;;     (setq projectile-enable-caching t)
;;     ;; Set the Projectile cache file directory
;;     (setq projectile-cache-file (expand-file-name "projectile.cache" user-emacs-directory))

;;     (setq projectile-enable-caching t)

;;     (setq projectile-allow-remote-projects t          ;; allow TRAMP projects
;;           projectile-track-known-projects-automatically t
;;           projectile-indexing-method 'alien           ;; faster over TRAMP
;;           projectile-enable-caching t)

;;     ;; Doom-style projectile settings
;;     (setq projectile-project-search-path '("~/src/" "~/projects/")
;;           projectile-globally-ignored-directories '(".git" "node_modules" "__pycache__" ".venv" "venv")
;;           projectile-globally-ignored-files '(".DS_Store" "TAGS" "*.elc")
;;           projectile-sort-order 'recentf
;;           projectile-completion-system 'ivy)

;;     ;; Allow remembering of remote projects
;;     (with-eval-after-load 'tramp
;;       (add-to-list 'tramp-remote-path 'tramp-own-remote-path)))

  (use-package counsel-projectile
    :after (counsel projectile)
    :ensure nil
    :config
    (counsel-projectile-mode))

(use-package perspective
  :ensure nil
  :demand t
  :init
