.files/.config/emacs/init.el
  (setq persp-mode-prefix-key (kbd "C-c M-p"))
  :config
  (persp-mode)

  ;; Show perspectives in tab-bar
  (setq tab-bar-show t
        tab-bar-new-button-show nil
        tab-bar-close-button-show nil)

  ;; Sync tab-bar with perspectives
  (add-hook 'persp-switch-hook #'persp-update-tab-bar)
  (add-hook 'persp-created-hook #'persp-update-tab-bar)
  (add-hook 'persp-killed-hook #'persp-update-tab-bar)

  (defun persp-update-tab-bar ()
    "Update tab-bar to show current perspective."
    (let ((persp-names (persp-names)))
      (setq tab-bar-tabs
            (mapcar (lambda (name)
                      `(tab
                        (name . ,name)
                        (explicit-name . t)
                        (current . ,(equal name (persp-current-name)))))
                    persp-names))))

  ;; Initial update
  (persp-update-tab-bar)

  ;; Integration with Ivy/Counsel - THIS IS THE KEY PART
  (setq read-buffer-function #'persp-read-buffer)
  (setq persp-show-modestring t)

  ;; Make ibuffer respect perspectives
  (add-hook 'ibuffer-hook
            (lambda ()
              (persp-ibuffer-set-filter-groups)
              (unless (eq ibuffer-sorting-mode 'alphabetic)
                (ibuffer-do-sort-by-alphabetic))))

  ;; Integration with projectile
  (with-eval-after-load 'projectile
    (require 'persp-projectile)))


;; Enhance projectile to auto-create perspectives
(with-eval-after-load 'projectile
  (defun my/projectile-switch-project-action ()
    "Switch to a perspective for the project, creating if needed."
    (persp-switch (projectile-project-name))
    (projectile-find-file))

  (setq projectile-switch-project-action #'my/projectile-switch-project-action))

(my/leader-keys
  "b"   '(:ignore t :which-key "Buffers")
  "bb"  '(persp-ivy-switch-buffer :which-key "Switch buffer")
  "bk"  '(kill-current-buffer :which-key "Kill buffer")
  "bB"  '(ivy-switch-buffer :which-key "Switch buffer (all)")
  "bs"  '(persp-ibuffer :which-key "List buffers")
  "br"  '(revert-buffer :which-key "Revert buffer")
  "bn"  '(next-buffer :which-key "Next buffer")
  "bp"  '(previous-buffer :which-key "Previous buffer"))

  (use-package perspective
    :config
    ;; Integrate Perspective with Projectile
    (use-package persp-projectile
      :ensure nil
      :bind (("C-c p p" . projectile-persp-switch-project))))

;; Also filter in switch-to-buffer
(advice-add 'switch-to-buffer :around
            (lambda (orig-fun &rest args)
              (let ((persp-buffers (persp-buffers (persp-curr))))
                (apply orig-fun args))))

(with-eval-after-load 'perspective
  ;; Make switch-to-buffer only show buffers in current perspective
  (setq read-buffer-function #'persp-read-buffer)

  ;; Make ibuffer only show current perspective's buffers
  (add-hook 'ibuffer-hook
            (lambda ()
              (persp-ibuffer-set-filter-groups)
              (unless (eq ibuffer-sorting-mode 'alphabetic)
                (ibuffer-do-sort-by-alphabetic))))

  (setq persp-show-modestring t))

;; NOTE: Not considered due to emacs-daemon
;; Force early credential loading
;; (add-hook 'emacs-startup-hook
;;           (lambda ()
;;             (ignore-errors
;;               (auth-source-search :max 1 :host "api.openai.com" :user "gptel")
;;               (auth-source-search :max 1 :host "api.anthropic.com" :user "gptel"))))

;; Configure gptel with multiple backends
(use-package gptel
  :ensure nil
  :config
  ;; Try with curl first (remove workaround)
  ;; (setq gptel-use-curl nil)  ; Comment this out to test

  (setq gptel-default-mode 'org-mode)

  ;; Define available backends with explicit models
  (setq gptel-backends
        (list
         ;; Claude (Anthropic) - set as default
         (gptel-make-anthropic "Claude"
           :stream t
           :key (lambda ()
                  (auth-source-pick-first-password :host "api.anthropic.com")))

         ;; OpenAI GPT with models
         (gptel-make-openai "ChatGPT"
           :stream t
           :models '(gpt-5
                     gpt-5-mini
                     gpt-5-nano)
           :key (lambda ()
                  (auth-source-pick-first-password :host "api.openai.com")))))

  ;; Set default backend
  (setq gptel-backend (car gptel-backends))

  (setq gptel-model 'claude-sonnet-4-5-20250929)

  ;; Custom directives for common tasks
  (gptel-make-directive "code-review"
                        "Review this code for bugs, performance, and best practices.")

  (gptel-make-directive "explain"
                        "Explain this code in simple terms."))

;; Helper function to switch between backends
(defun my/gptel-switch-backend ()
  "Interactively switch between configured gptel backends."
  (interactive)
  (let* ((backend-names (mapcar (lambda (b) (gptel-backend-name b)) gptel-backends))
         (choice (completing-read "Select backend: " backend-names nil t)))
    (setq gptel-backend (seq-find (lambda (b)
                                    (string= (gptel-backend-name b) choice))
                                  gptel-backends))
    (message "Switched to %s" choice)))

(defun my/ai-continue-code ()
  "Send selected region/function with 'continue this' prompt"
  (interactive)
  (gptel-send "Continue implementing this:" :context 'buffer))

(defun my/ai-fix-error ()
  "Fix compilation/runtime error at point"
  (interactive)
  (gptel-send "Fix this error:" :context 'buffer))

;; Keybindings
(my/leader-keys
  "o"    '(:ignore t :which-key "AI models")
  "oa"   '(gptel-abort :which-key "Abort gptel invocation")
  "ob"   '(my/gptel-switch-backend :which-key "Switch AI backend")
  "oc"   '(:ignore t :which-key "AI context")
  "ocb"  '(gptel-add :which-key "Add/Remove buffer to AI context")
  "occ"  '(my/ai-continue-code :which-key "Continue this")
  "ocf"  '(gptel-context-add-file :which-key "Add file to AI context")
  "ocr"  '(gptel-context-remove-all :which-key "Remove all AI context")
  "of"   '(my/ai-fix-error :which-key "Fix this error")
  "og"   '(gptel :which-key "Invoke gptel")
  "oi"   '(gptel-send :which-key "Send to AI")
  "om"   '(gptel-menu :which-key "gptel-menu")
  "or"   '(gptel-rewrite :which-key "AI model rewrite")
  "ov"   '(aider-transient-menu :which-key "Vibe code w/ Aider"))

  (add-to-list 'auto-mode-alist '("CMakeLists\\.txt\\'" . cmake-mode))
  (add-to-list 'auto-mode-alist '("\\.cmake\\'" . cmake-mode))
