emacs.org
** Setup

This setup is inspired in [[https://github.com/rougier/dotemacs/blob/b31f0bea9ff8d6aa5c8e424bd4850bbc9b79470b/dotemacs.org#setup][rougier/dotemacs]]:

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package mu4e
    :ensure nil  ;; mu4e is installed externally; not via package.el
    :load-path "/usr/share/emacs/site-lisp/mu4e"  ;; Adjust this path if necessary
    :commands (mu4e)  ;; Ensure it's available for 'after' directives
    :defer t
    :init
    ;; General mu4e settings that need to be set before mu4e loads
    (setq mu4e-maildir "~/.local/share/mail"
          mu4e-attachment-dir "~/Downloads"
          mu4e-get-mail-command  "guix shell -L ~/.dotfiles cyrus-sasl-xoauth2 -- mbsync -a"
          mu4e-update-interval 300
          mu4e-index-cleanup t
          mu4e-index-update-error-warning t
          mu4e-hide-index-messages t
          mu4e-index-update-in-background t
          mu4e-change-filenames-when-moving t
          mu4e-index-lazy-check nil
          mu4e-confirm-quit nil
          mu4e-split-view 'single-window
          mu4e-headers-auto-update nil
          mu4e-headers-date-format "%d-%m"
          mu4e-headers-time-format "%H:%M"
          mu4e-headers-from-or-to-prefix '("" . "To ")
          mu4e-headers-include-related t
          mu4e-headers-skip-duplicates t
          sendmail-program "msmtp"
          send-mail-function 'smtpmail-send-it
          message-sendmail-f-is-evil t
          message-sendmail-extra-arguments '("--read-envelope-from")
          message-send-mail-function 'message-send-mail-with-sendmail)
    :config
    ;; Unbind conflicting keys if necessary
    (define-key mu4e-headers-mode-map (kbd "C--") nil)
    (define-key mu4e-view-mode-map (kbd "C--") nil)
    (define-key mu4e-headers-mode-map (kbd "C-c c") 'mu4e-org-store-and-capture)
    (define-key mu4e-view-mode-map    (kbd "C-c c") 'mu4e-org-store-and-capture)

    ;; Custom keybindings with Evil
    (with-eval-after-load 'evil
      ;; Ensure 'a' is available in visual state in mu4e-view-mode
      (evil-define-key 'visual mu4e-view-mode-map (kbd "a") 'mu4e-view-action)
      ;; Similarly, for mu4e-headers-mode if needed
      (evil-define-key 'visual mu4e-headers-mode-map (kbd "a") 'mu4e-headers-mark-for-*))

    ;; Reset variables, as our configuration is based on contexts
    (setq mu4e-contexts nil
          mu4e-drafts-folder nil
          mu4e-compose-reply-to-address nil
          mu4e-compose-signature t
          mu4e-compose-signature-auto-include t
          mu4e-sent-folder nil
          mu4e-trash-folder nil)

    ;; Set mu4e signature
    (setq mu4e-compose-signature "Prof. Rafael Palomar, Ph.D.
  __________________________________
  Head of Medical Software Research Laboratory (MESH|Lab)
  The Intervention Centre, Oslo University Hospital (OUH)
  Sognsvannsveien 20 (Rikshospitalet Building D-6.3002)
  N-0372 Oslo, Norway
  rafael.palomar@ous-research.no
  https://ivs.no

  Associate Professor
  Norwegian University of Science and Technology (NTNU)
  Teknologiveien 22, 2815 Gjøvik, Norway
  rafael.palomar@ntnu.no
  https://ntnu.no
  --")

    ;; Define mu4e contexts
    (setq mu4e-contexts
          (list
           ;; NTNU Account
           (make-mu4e-context
            :name "NTNU"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/rafael.palomar@ntnu.no" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address      . "rafael.palomar@ntnu.no")
                    (user-full-name         . "Rafael Palomar")
                    (mu4e-drafts-folder     . "/rafael.palomar@ntnu.no/Drafts")
                    (mu4e-sent-folder       . "/rafael.palomar@ntnu.no/Sent")
                    (mu4e-trash-folder      . "/rafael.palomar@ntnu.no/Trash")
                    (mu4e-refile-folder     . "/rafael.palomar@ntnu.no/Archive")
                    ;; Configure SMTP
                    (smtpmail-smtp-user     . "rafael.palomar@ntnu.no")
                    (smtpmail-smtp-server   . "smtp.office365.com")
                    (smtpmail-smtp-service  . 587)
                    (smtpmail-stream-type   . starttls)))
           ;; OUS-Research Account
           (make-mu4e-context
            :name "OUS-Research"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/rafael.palomar@ous-research.no" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address      . "rafael.palomar@ous-research.no")
                    (user-full-name         . "Rafael Palomar")
                    (mu4e-drafts-folder     . "/rafaelpa@ous-research.no/Drafts")
                    (mu4e-sent-folder       . "/rafaelpa@ous-research.no/Sent")
                    (mu4e-trash-folder      . "/rafaelpa@ous-research.no/Trash")
                    (mu4e-refile-folder     . "/rafaelpa@ous-research.no/Archive")
                    ;; Configure SMTP
                    (smtpmail-smtp-user     . "rafaelpa@uio.no")
                    (smtpmail-smtp-server   . "smtp.office365.com")
                    (smtpmail-smtp-service  . 587)
                    (smtpmail-stream-type   . starttls))))))


  (use-package mu4e-dashboard
    :ensure nil  ;; Adjust accordingly if you install it via package.el
    :after mu4e
    :config
    (require 'svg-lib)  ;; Ensure svg-lib is loaded
    (setq mu4e-dashboard-propagate-keymap nil)

    (defun mu4e-dashboard ()
      "Open the mu4e dashboard on the left side."
      (interactive)
      (with-selected-window
          (split-window (selected-window) -34 'left)
        (find-file (expand-file-name "mu4e-dashboard.org" user-emacs-directory))
        (mu4e-dashboard-mode)
        (hl-line-mode)
        (set-window-dedicated-p nil t)
        (defvar svg-font-lock-keywords
          `(("\\!\\([\\ 0-9]+\\)\\!"
             (0 (list 'face nil 'display (svg-font-lock-tag (match-string 1)))))))
        (defun svg-font-lock-tag (label)
          (svg-lib-tag label nil
                       :stroke 0 :margin 1 :font-weight 'bold
                       :padding (max 0 (- 3 (length label)))
                       :foreground (face-foreground 'nano-popout-i)
                       :background (face-background 'nano-popout-i)))
        (push 'display font-lock-extra-managed-props)
        (font-lock-add-keywords nil svg-font-lock-keywords)
        (font-lock-flush (point-min) (point-max)))))


  (my/leader-keys
    "m"    '(:ignore t :which-key "Mail")
    "mm"   '(mu4e :which-key "Open mu4e")
    "mq"   '(mu4e-quit :which-key "Quit mu4e")

    "mc"  '(:ignore t :which-key "Compose")
    "mcc" '(mu4e-compose-new :which-key "Compose new email (plain text)")
    "mcC" '(my-mu4e-compose-new-with-org-mode :which-key "Compose new email with Org-mode")
    "mr"  '(:ignore t :which-key "Reply")
    "mrr" '(mu4e-compose-reply :which-key "Reply (plain text)")
    "mrR" '(my-mu4e-compose-reply-with-org-mode :which-key "Reply with Org-mode"))

          #+end_src

* tramp
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

  ;;; --------- tramp -------

  (with-eval-after-load 'tramp
    (require 'tramp-container)
    (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
    ;; Use /bin/bash (or /bin/sh) on every remote host
    (add-to-list 'tramp-connection-properties
                 '(".*" "remote-shell" "/bin/sh"))
    ;; every docker hop  → /bin/sh
    (add-to-list 'tramp-connection-properties
                 '("\\`/docker:" "remote-shell" "/bin/sh"))
    ;; If you also want to force a login shell:
    (add-to-list 'tramp-connection-properties
                 '(".*" "remote-shell-login" ("-l")))
    ;; (optional) keep TRAMP’s default remote path plus the usual ones
    (add-to-list 'tramp-connection-properties
                 '(".*" "remote-path"
                   ("/usr/local/sbin" "/usr/local/bin" "/usr/bin" "/bin"
                    tramp-own-remote-path))))
#+end_src
