emacs.org
* dired

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
;; Icons in dired
(use-package all-the-icons-dired
  :ensure nil
  :hook (dired-mode . all-the-icons-dired-mode))

;; Dired configurations
(use-package dired
  :ensure nil
  :custom
  ;; Copy/move to other dired window
  (dired-dwim-target t)

  ;; Better listings
  (dired-listing-switches "-alh --group-directories-first")

  ;; Reuse same buffer
  (dired-kill-when-opening-new-dired-buffer t)

  :hook
  ;; Hide details by default
  (dired-mode . dired-hide-details-mode)

  :config
  ;; Enable dired-x for extra features
  (require 'dired-x)

  ;; Hide dotfiles by default (toggle with M-o)
  (setq dired-omit-files "^\\.[^.]")

  ;; Use 'a' to reuse the same buffer
  (put 'dired-find-alternate-file 'disabled nil)

  ;; Better keybindings
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "^")
    (lambda () (interactive) (find-alternate-file ".."))))

;; Colorful dired
(use-package diredfl
  :ensure nil
  :hook (dired-mode . diredfl-mode))

;; Extra dired features
(use-package dired-aux
  :ensure nil
  :config
  (setq dired-create-destination-dirs 'ask
        dired-vc-rename-file t))

#+end_src

* denote

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

    (use-package denote
      :ensure nil
      :config
      ;; Define silos for Work and Personal notes
      (setq denote-directory "~/Notes/Work/")

      (setq denote-silo-extras-directories
            '(("personal" . "~/Notes/Personal/")))

      (defvar my-denote-to-agenda-regexp "_agenda"
        "Denote file names that are added to the agenda.
          See `my-add-denote-to-agenda'.")

      (defun my-denote-add-to-agenda ()
        "Add current file to the `org-agenda-files', if needed.
          The file's name must match the `my-denote-to-agenda-regexp'.

          Add this to the `after-save-hook' or call it interactively."
        (interactive)
        (when-let* ((file (buffer-file-name))
                    ((denote-file-is-note-p file))
                    ((string-match-p my-denote-to-agenda-regexp (buffer-file-name))))
          (add-to-list 'org-agenda-files file)))

      ;; Example to add the file automatically. Comment/Uncomment it:
      (add-hook 'after-save-hook #'my-denote-add-to-agenda)

      (defun my-denote-remove-from-agenda ()
        "Remove current file from the `org-agenda-files'.
          See `my-denote-add-to-agenda' for how to add files to the Org
          agenda."
        (interactive)
        (when-let* ((file (buffer-file-name))
                    ((string-match-p my-denote-to-agenda-regexp (buffer-file-name))))
          (setq org-agenda-files (delete file org-agenda-files)))))

  (use-package denote-silo
    :ensure nil
    ;; Bind these commands to key bindings of your choice.
    :commands ( denote-silo-create-note
          denote-silo-open-or-create
          denote-silo-select-silo-then-command
          denote-silo-dired
          denote-silo-cd )
    :config
    ;; Add your silos to this list.  By default, it only includes the
    ;; value of the variable `denote-directory'.
    (setq denote-silo-directories
    (list denote-directory
          "~/Notes/Personal/")))

#+end_src

* Dashboard

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(use-package dashboard
  :ensure nil
  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
#+end_src
* avy
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package avy
    :ensure nil
    :config
    ;; Set the style for how avy displays candidates
    (setq avy-style 'at-full
          avy-all-windows t
          avy-background t))
#+end_src

* beacon
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(use-package beacon
  :ensure nil
  :config
  (beacon-mode 1))
#+end_src

* tabspaces

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package tabspaces
    :ensure nil
    :after (persp-mode)
    :hook (after-init . tabspaces-mode)
    :init
    (setq tabspaces-use-filtered-buffers-as-default t
          tabspaces-default-tab "Main"
          tabspaces-remove-to-default t
          tabspaces-include-buffers '("*scratch*")
          tabspaces-session t)
    :config
    ;; Automatically create workspaces when switching projects
    (defun my/project-switch ()
      "Switch project and create a new tab/workspace."
      (interactive)
      (let ((project (project-prompt-project-dir)))
        (tabspaces-switch-or-create-workspace (car (last (split-string project "/" t))))
        (project-switch-project project))))
#+end_src

* guile-guix
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  ;; Geiser + Guile
  (use-package geiser
    :ensure nil
    :init
    (setq geiser-active-implementations '(guile))
    :hook
    ((scheme-mode . geiser-mode))
    :config
    (setq geiser-mode-auto-p t))

  (use-package geiser-guile
    :ensure nil
    :config
    ;; You already have these, just keep them consolidated here:
    (add-to-list 'geiser-guile-load-path "~/src/guix")
    (add-to-list 'geiser-guile-load-path "~/src/nonguix")
    (add-to-list 'geiser-guile-load-path "~/src/guix-systole/systole")
    (add-to-list 'geiser-guile-load-path "~/src/guix-systole/system")
    ;; Optional: pass extra -L paths to REPL on start (redundant with load-path above)
    ;; (setq geiser-guile-extra-load-path geiser-guile-load-path)
    )

  ;; Evil-friendly navigation in Scheme
  ;; (with-eval-after-load 'evil
  ;;   (evil-define-key 'normal scheme-mode-map (kbd "gd") #'xref-find-definitions)
  ;;   (evil-define-key 'normal scheme-mode-map (kbd "gD") #'xref-find-references))

  ;; Structural editing and readability
  (use-package paredit
    :ensure nil
    :hook (scheme-mode . paredit-mode))

  (use-package rainbow-delimiters
    :ensure nil
    :hook (scheme-mode . rainbow-delimiters-mode))
#+end_src

* Magit Forge

#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
  (use-package forge
  :after magit
  :ensure nil                       ;; package provided by Guix
  :config
  ;; Where the credentials live (same as you do for GPTel etc.)
  (setq auth-sources '("~/.authinfo.gpg"))

  ;; Register the forges you use (GitHub + GitLab examples)
  (setq forge-alist
        '(("github.com" "api.github.com" "github.com" forge-github-repository)
          ("gitlab.com" "gitlab.com/api/v4" "gitlab.com" forge-gitlab-repository)))

  ;; Optional: fetch issues automatically when you `M-x magit-status`
  (setq forge-add-default-bindings t         ; C-c C-f prefix
        forge-database-file (expand-file-name "forge-db.sqlite" user-emacs-directory))
  )
#+end_src

* Python
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el

  (require 'pyvenv)
  (pyvenv-mode 1)  ;; Enable pyvenv mode

#+end_src

