.files/.config/emacs/init.el

  ;;; c-style-vtk.el --- Visualization ToolKit (VTK) Emacs C Style.
  ;;; Extracted from https://raw.githubusercontent.com/MartinNowak/elisp/6466ef96d228b496c2db8ca898ffe316caf5e765/mine/c-style-vtk.el

  ;; --- Register the VTK indentation style -----------------------------
  (with-eval-after-load 'cc-mode
    (c-add-style
     "vtk"
     '("stroustrup"                       ; inherit, then override
       (c-basic-offset          . 2)
       (indent-tabs-mode        . nil)
       (c-comment-only-line-offset . 0)
       (c-electric-pound-behavior . (alignleft))

       (c-offsets-alist
        ;; the list below is copied from `c-set-indent-vtk`
        (case-label             . 0)
        (label                  . 0)
        (topmost-intro-cont     . 0)

        (block-open             . +)
        (block-close            . 0)

        (substatement           . +)
        (substatement-open      . +)

        (statement-block-intro  . 0)
        (access-label           . -)

        (string                 . c-lineup-dont-change)
        (c                     . c-lineup-C-comments)

        (defun-block-intro      . +)
        (member-init-intro      . +)
        (member-init-cont       . 0)

        (func-decl-cont         . +)

        (brace-list-intro       . +)
        (brace-list-entry       . 0)

        (statement-cont         . +)
        (statement-case-intro   . +)
        (statement-case-open    . +)

        (arglist-intro          . c-lineup-arglist-intro-after-paren)
        (arglist-cont          . c-lineup-arglist)
        (arglist-cont-nonempty . c-lineup-arglist)
        (arglist-close          . c-lineup-arglist)

        (stream-op              . c-lineup-streamop)
        (inclass                . +)

        (cpp-macro              . -1000)
        (cpp-macro-cont         . c-lineup-dont-change)

        (objc-method-intro      . -1000)
        (objc-method-args-cont  . c-lineup-ObjC-method-args)
        (objc-method-call-cont  . c-lineup-ObjC-method-call)

        (extern-lang-open       . 0)
        (extern-lang-close      . 0)
        (inextern-lang          . +)

        (namespace-open         . 0)
        (namespace-close        . 0)
        (innamespace            . +)

        (template-args-cont     . +)
        (inlambda               . c-lineup-inexpr-block)
        (lambda-intro-cont      . +)
        (inexpr-statement       . 0)
        (inexpr-class           . +)))))

  (use-package prescient
    :ensure nil
    :config
    (prescient-persist-mode 1))

  (use-package ivy-prescient
    :ensure nil
    :after (ivy prescient)
    :config
    (ivy-prescient-mode 1)
    (setq ivy-prescient-retain-classic-highlighting t))

  ;; Company Mode for in-buffer completion (Doom default)
  (use-package company
    :ensure nil
    :hook (prog-mode . company-mode)
    :config
    (setq company-idle-delay 0.2
          company-minimum-prefix-length 2
          company-show-numbers t
          company-tooltip-align-annotations t
          company-tooltip-limit 12
          company-backends '((company-capf company-files company-keywords))
          company-global-modes '(not erc-mode message-mode help-mode)))

  ;; Company prescient integration
  (use-package company-prescient
    :ensure nil
    :after (company prescient)
    :config
    (company-prescient-mode 1))

(use-package hl-todo
  :ensure nil
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-keyword-faces
        '(("TODO"   . "#FF0000")
          ("FIXME"  . "#FF0000")
          ("HACK"   . "#FFA500")
          ("NOTE"   . "#00FF00")
          ("DEPRECATED" . "#808080"))))

;; Smart whitespace cleanup
(use-package ws-butler
  :ensure nil
  :hook (prog-mode . ws-butler-mode))


;; (use-package flycheck
;;   :ensure nil
;;   :hook (prog-mode . flycheck-mode)
;;   :config
;;   (setq flycheck-check-syntax-automatically '(save mode-enabled)
;;         flycheck-display-errors-delay 0.3))

;; (use-package yasnippet
;;   :ensure nil
;;   :hook (prog-mode . yas-minor-mode)
;;   :config
;;   (setq yas-snippet-dirs
;;         '("~/.config/emacs/snippets"))
;;   (yas-reload-all))

(use-package envrc
  :ensure nil
  :hook (after-init . envrc-global-mode))

  ;; ERC - Emacs IRC Client
  (use-package erc
    :ensure nil
    :commands (erc erc-tls)
    :config
    ;; Basic settings
    (setq erc-server-coding-system '(utf-8 . utf-8)
          erc-interpret-mirc-color t
          erc-rename-buffers t
          erc-hide-list '("JOIN" "PART" "QUIT")
          erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                    "324" "329" "332" "333" "353" "477")
          erc-lurker-hide-list '("JOIN" "PART" "QUIT")
          erc-kill-buffer-on-part t
          erc-kill-queries-on-quit t
          erc-kill-server-buffer-on-quit t
          erc-autojoin-timing 'ident
          erc-fill-function 'erc-fill-static
          erc-fill-static-center 22
          erc-timestamp-format "[%H:%M] "
          erc-prompt-for-nickserv-password nil))

    ;; Auto-identify with services using authinfo
    (use-package erc-services
      :ensure nil
      :config
      (erc-services-mode 1)
      (setq erc-prompt-for-nickserv-password nil
            erc-nickserv-passwords nil))

    ;; Track activity
    (use-package erc-track
      :ensure nil
      :config
      (erc-track-mode 1)
      (setq erc-track-visibility nil
            erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                      "324" "329" "332" "333" "353" "477")))

    ;; Notification support
    (use-package erc-match
      :ensure nil
      :config
      (erc-match-mode 1)
      (setq erc-keywords '("your-keywords-here")))

    ;; Logging
    (use-package erc-log
      :ensure nil
      :config
      (setq erc-log-channels-directory "~/.local/share/erc/logs/"
            erc-save-buffer-on-part nil
            erc-save-queries-on-quit nil
            erc-log-write-after-send t
            erc-log-write-after-insert t))

  ;; Helper function to connect to common IRC networks
  (defun my/erc-connect (server port nick)
    "Connect to IRC SERVER on PORT with NICK.
  Credentials should be in ~/.authinfo.gpg with format:
  machine irc.libera.chat login yournick password yourpass"
    (interactive
     (list
      (read-string "Server: " "irc.libera.chat")
      (read-number "Port: " 6697)
      (read-string "Nick: " user-login-name)))
    (let* ((auth (auth-source-search :host server
                                     :user nick
                                     :require '(:secret)
                                     :max 1))
           (password (when auth
                      (funcall (plist-get (car auth) :secret)))))
      (erc-tls :server server
               :port port
               :nick nick
               :password password)))

  ;; Keybindings
  (my/leader-keys
    "a"   '(:ignore t :which-key "Applications")
    "ai"  '(:ignore t :which-key "IRC")
    "aic" '(my/erc-connect :which-key "Connect to IRC")
    "aiq" '(erc-quit-server :which-key "Quit IRC server")
    "aib" '(erc-switch-to-buffer :which-key "Switch IRC buffer"))

;; GitHub Copilot - best for vibe coding
(use-package copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . copilot-accept-completion)
              ("TAB" . copilot-accept-completion)))
