emacs.org
*  Aider
#+begin_src emacs-lisp :tangle .files/.config/emacs/init.el
(use-package aider
  :config
  ;; Point to wrapper script
  (setq aider-program (expand-file-name "~/.local/bin/aider-wrapper.sh"))

  (setq aider-args
        (list "--model" "claude-sonnet-4-5-20250929"
              "--no-auto-commits"))
  )

(defun my/aider-setup-api-key ()
  "Set Anthropic API key before running aider."
  (unless (getenv "ANTHROPIC_API_KEY")
    (setenv "ANTHROPIC_API_KEY"
            (auth-source-pick-first-password :host "api.anthropic.com" :user "aider"))))

(advice-add 'aider-transient-menu :before #'my/aider-setup-api-key)
(advice-add 'aider :before #'my/aider-setup-api-key)

(defun my/ai-commit-message ()
  "Generate a commit message from staged changes."
  (interactive)
  (let* ((diff (shell-command-to-string "git diff --cached"))
         (prompt (format "Write a concise commit message (conventional commits format) for:\n\n%s" diff)))
    (gptel-request
        prompt
      :callback
      (lambda (response info)
        (when response
          (kill-new (string-trim response))
          (message "Commit message copied: %s" (string-trim response)))))))

(my/leader-keys
  "g"   '(:ignore t :which-key "Git")
  "gs"  '(magit-status :which-key "Magit Status")
  "gg"  '(magit-status :which-key "Magit Status")
  "gb"  '(magit-branch-checkout :which-key "Checkout branch")
  "gc"  '(:ignore t :which-key "Commit")        ; Make it a prefix
  "gcc" '(magit-commit-create :which-key "Commit")
  "gca" '(my/ai-commit-message :which-key "AI commit msg")
  "gC"  '(magit-clone :which-key "Clone repository")
  "gp"  '(magit-push-current :which-key "Push changes")
  "gl"  '(magit-log :which-key "Show log"))

#+end_src
